{
    "authors": [],
    "date_download": "2021-10-18 15:37:28",
    "date_modify": null,
    "date_publish": "2021-10-15 19:00:00",
    "description": "Binance Coin (BNB) is gearing up for another attempt at moving above its September highs. Technical indicators are bullish.",
    "filename": "https%3A%2F%2Fbeincrypto.com%2Fbinance-coins-bnb-next-move-see-new-all-time-high%2F.json",
    "image_url": "https://s32659.pcdn.co/wp-content/uploads/2021/04/BIC_BNB-02.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Binance Coin (BNB) is gearing up for another attempt at moving above its September highs.\nSponsored\nSponsored\nThe upward movement is supported by both the price action and readings from technical indicators.\nBNB\nSince May 23, BNB has been moving upwards, following an ascending support line. Therefore, the line seems to be measuring the rate of increase for BNB.\nSponsored\nSponsored\nSo far, the token has reached a high of $518.9, doing so on Aug 26. However, it has been decreasing since. The decrease served to validate the $511 area as resistance. This is the 0.618 Fib retracement level, which most commonly acts as resistance. Therefore, BNB has to reclaim it in order for the trend to be considered bullish.\nOn Sept 26, the token bounced at the ascending support line once more. This served both to validate the line once more and put an end to the ongoing decrease.\nTechnical indicators in the daily time-frame have also turned bullish. The RSI, which is a momentum indicator, has bounced at the 50 line and is moving upwards. The 50 line often acts as a determinant for the direction of the trend. The previous cross above 50 transpired on July 27 (green icon) and preceded the entire upward movement.\nThe MACD is positive and increasing. The MACD is created by short- and long-term moving averages (MA), and the reading means that the short-term trend is faster than the long-term one.\nFinally, the Supertrend is bullish (green circle). The Supertrend is an indicator that uses absolute high and low prices in order to determine the direction of the trend. Since BNB is above the line, the indicator is considered bullish.\nTherefore, readings from the daily time-frame suggest that the trend is bullish.\nOngoing breakout\nThe shorter-term two-hour chart supports the continuation of the upward movement. It shows that BNB has already broken out from a descending resistance line, putting an end to the previous decrease.\nMore importantly, the token has moved above the 0.618 Fib retracement resistance area. While the initial rejection on Oct 7 (red circle) cast some doubt on the upward movement, its subsequent reclaim alongside the breakout from the descending resistance line support the possibility that BNB will move higher.\nWave count\nCryptocurrency trader @24KCrypto outlined a BNB chart, stating that the token has begun a long-term wave five that will take it to a new all-time high price.\nIn order for the count to remain valid, BNB has to hold above the Sept 26 low at $320 (red line). As long as it is doing so, it is possible that the current increase is part of wave three of a bullish impulse. Wave three is often the sharpest, therefore the rate of increase would be expected to accelerate soon. This also fits with the readings from technical indicators.\nA decrease below the line would invalidate this potential count.\nFor BeInCrypto’s latest Bitcoin (BTC) analysis, click here.\nWhat do you think about this subject? Write to us and tell us!",
    "nlp": [
        "going",
        "soon",
        "etf",
        "sec",
        "million",
        "approval",
        "fund",
        "crypto",
        "bitcoin",
        "raises",
        "oct",
        "week",
        "hodlers",
        "digital",
        "futures",
        "launches",
        "digest",
        "celsius"
    ],
    "source_domain": "beincrypto.com",
    "summary": "Winners and LosersAt the end of the week, Bitcoin (BTC) is at $60,687, Ether (ETH) at $3,817 and XRP at $1.13.\nIs the SEC going to allow that?\nEarly in October, Balchunas mentioned 75% odds for Bitcoin futures ETF greenlighting in October.\nCointelegraph published a separate article this week covering comments from Todd Rosenbluth, CFRA’s senior director of ETF and mutual fund research, who noted Bitcoin futures ETF approval may not arrive until 2022.\nMeanwhile, evidence surfaced on Friday showing the groundwork being laid for a potential SEC approval of Valkyrie’s Bitcoin futures ETF.",
    "text": null,
    "title": "Binance Coin's (BNB) Next Move Could See New All-Time High Next",
    "title_page": null,
    "title_rss": null,
    "url": "https://beincrypto.com/binance-coins-bnb-next-move-see-new-all-time-high/"
}